Public Attributes | List of all members
API_CollisionElem Struct Reference
Element Manager API
A container for storing a collision element created by ACAPI_Element_GetCollisions. More...
#include <APIdefs_Goodies.h>
 Public Attributes
API_Guid  | collidedElemGuid
The GUID of the collided element.
bool  | hasBodyCollision
The element has body collision.
bool  | hasClearenceCollision
The element has clearance collision.
bool  | filler [6]
Detailed Description
A container for storing a collision element created by ACAPI_Element_GetCollisions.
Member Data Documentation
◆ collidedElemGuid
 API_CollisionElem::collidedElemGuid
The GUID of the collided element.
◆ filler
 bool API_CollisionElem::filler[6]
◆ hasBodyCollision
 API_CollisionElem::hasBodyCollision
The element has body collision.
◆ hasClearenceCollision
 API_CollisionElem::hasClearenceCollision
The element has clearance collision.